/*==========================================================
  ■■■ 실행 흐름의 컨트롤(제어문, 조건문과 반복문) ■■■
  - 반복문(while문) 실습
 ==========================================================*/
 
 // ○ 과제
 // 사용자로부터 임의의 두 정수를 입력받아
 // 1부터 입력받은 그 수 까지의
 // 전체 합과, 짝수의 합과, 홀수의 합을
 // 각각 결과값으로 출력하는 프로그램을 구현한다.

 // 실행 예)
 // 임의의 정수 입력 : 270
 // >> 1 ~ 270 까지 정수의 합 : xxxx
 // >> 1 ~ 270 까지 짝수의 합 : xxxx
 // >> 1 ~ 270 까지 홀수의 합 : xxxx
 // 계속하려면 아무 키나 누르세요...


public class Test048
{
	public static void main(String[] args)
	{
	}
}