/*===================================
  ■■■ 연산자(Operator) ■■■
  - 비트 단위 연산자
 ===================================*/

public class Test022
{
	public static void main(String[] args)
	{
		// 주요 변수 선언
		int a = 13, b = 7;
		int c, d, e;

		// 연산 및 처리
		c = a & b;
		d = a | b;
		e = a ^ b;

		//결과 출력
		System.out.printf("a & b : %d\n", c);
		System.out.printf("a | b : %d\n", d);
		System.out.printf("a ^ b : %d\n", e);
	}
}

//실행 결과
/*
a & b : 5
a | b : 15
a ^ b : 10
계속하려면 아무 키나 누르십시오 . . .
*/

/*
		 13 → 00001101
     	& 7 → 00000111
		---------------
			   00000101  → 5  
			   
			   
		 13 → 00001101
     	| 7 → 00000111
		---------------
               00001111 → 1+2+4+8 → 15

         13 → 00001101
     	^ 7 → 00000111
		---------------
               00001010 → 2+8 → 10
			
// & : 둘 모두 1이면 1
// | : 둘 중 하나라도 1이면 1
// ^ : 둘 다 1이 아니면 1

*/