/*==========================================================
  ■■■ 실행 흐름의 컨트롤(제어문, 조건문과 반복문) ■■■
  - 반복문(for문) 실습
  - 다중 for문(반복문의 중첩)을 활용한 구구단 출력 실습
 ==========================================================*/
// 실행 예)
/*

2 * 1 = 2  3 * 1 = 3  4 * 1 = 4  5 * 1 = 5
2 * 2 = 4  3 * 2 = 6  4 * 2 = 8  5 * 2 = 10
2 * 3 = 6  3 * 3 = 9  4 * 3 = 4  5 * 3 = 15
2 * 4 = 8  3 * 4 = 12 4 * 4 = 16 5 * 4 = 20
2 * 5 = 10 3 * 5 = 15 4 * 5 = 20 5 * 5 = 25
2 * 6 = 12 3 * 6 = 18 4 * 6 = 24 5 * 6 = 30
2 * 7 = 14 3 * 7 = 21 4 * 7 = 28 5 * 7 = 35
2 * 8 = 16 3 * 8 = 24 4 * 8 = 32 5 * 8 = 40
2 * 9 = 18 3 * 9 = 27 4 * 9 = 36 5 * 9 = 45

6 * 1 = 6  7 * 1 = 7  8 * 1 = 8  9 * 1 = 9
6 * 2 = 12 7 * 2 = 14 8 * 2 = 16 9 * 2 = 18
6 * 3 = 18 7 * 3 = 21 8 * 3 = 24 9 * 3 = 27
6 * 4 = 24 7 * 4 = 28 8 * 4 = 32 9 * 4 = 36
6 * 5 = 30 7 * 5 = 35 8 * 5 = 40 9 * 5 = 45
6 * 6 = 36 7 * 6 = 42 8 * 6 = 48 9 * 6 = 54
6 * 7 = 42 7 * 7 = 49 8 * 7 = 56 9 * 7 = 63
6 * 8 = 48 7 * 8 = 56 8 * 8 = 64 9 * 8 = 72
6 * 9 = 54 7 * 9 = 63 8 * 9 = 72 9 * 9 = 81

*/


// ① 포문 이중첩 두개 사용
// ② 포문 삼중첩 사용

/*
public class Test055
{
	public static void main(String[] args)
	{
*/
		// ① 포문 이중첩 두개 사용
		/* > 이거 아님!
		int i, j;
		for(i=2; i<=5; i++)  // >> i : 2, 3, 4, 5
		{	
			System.out.println();
			for(j=1; j<=9; j++)  // >> j : 1, 2, 3, 4, 5, 6, 7, 8, 9
			System.out.printf("%d * %d = %d\n", i, j, (i*j));

		*/

		/*
		[내가 만든 코드]

		// > 얘로 맞는 코드 나옴

		int i, j;
		for(j=1; j<=9; j++)
		{	System.out.println();
			for(i=2; i<=5; i++)
			{
			System.out.printf("%d * %d = %3d ", i, j, (i*j));
			}
		}

		System.out.println();

		for(j=1; j<=9; j++)
		{	System.out.println();
			for(i=6; i<=9; i++)
			{
			System.out.printf("%d * %d = %3d ", i, j, (i*j));
			}
		}

		System.out.println();

		// ② 포문 삼중첩 사용 >> 대체 어떻게 들어가지....??
		
		
		int k;

		for(k=4;k<=8;k++);	 //윙~웅웅~숑숑숑숑 ->> 맨위에는 줄바꿈 들어갈 거 필요.. 흐으음...
		{	System.out.println();
			for(j=1; j<=9; j++)
			{	System.out.println();
				for(i=2; i<=9; i++)
				{
				System.out.printf("%d * %d = %3d ", i, j, (i*j));
				}
			}

		}
		*/
		
		// [함께 작성한 코드]

public class Test055
{
	public static void main(String[] args)
	{
		for (int h=0; h<=1; h++)		// 문단 구성 → 0 1
		{
			for(int i=1;i <=9; i++)		// 곱해지는 수 구성 → 1 2 3 4 5 6 7 8 9
		{
			for (int j=2; j<=5; j++)	// 단 구성 → 2 3 4 5 6 7 8 9 → 2 3 4 5
			{
				System.out.printf("%4d * %d = %2d", h*4+j, i, ((h*4+j)*i)); //@ 위, 아래 단락에서 다른건 h뿐! //@ 괄호로 잘 묶어주기
				//									h→0 → 2345
				//									h→1 → 6789
			}
			System.out.println();
		}
		System.out.println();
		}

	}
}		// 한번에 X, 단계별로 차근차근히 하기
		// 뒤로가기 cntl+z, 앞으로가기 cntl+y

// 결과 실행
/*
   2 * 1 =  2   3 * 1 =  3   4 * 1 =  4   5 * 1 =  5
   2 * 2 =  4   3 * 2 =  6   4 * 2 =  8   5 * 2 = 10
   2 * 3 =  6   3 * 3 =  9   4 * 3 = 12   5 * 3 = 15
   2 * 4 =  8   3 * 4 = 12   4 * 4 = 16   5 * 4 = 20
   2 * 5 = 10   3 * 5 = 15   4 * 5 = 20   5 * 5 = 25
   2 * 6 = 12   3 * 6 = 18   4 * 6 = 24   5 * 6 = 30
   2 * 7 = 14   3 * 7 = 21   4 * 7 = 28   5 * 7 = 35
   2 * 8 = 16   3 * 8 = 24   4 * 8 = 32   5 * 8 = 40
   2 * 9 = 18   3 * 9 = 27   4 * 9 = 36   5 * 9 = 45

   6 * 1 =  6   7 * 1 =  7   8 * 1 =  8   9 * 1 =  9
   6 * 2 = 12   7 * 2 = 14   8 * 2 = 16   9 * 2 = 18
   6 * 3 = 18   7 * 3 = 21   8 * 3 = 24   9 * 3 = 27
   6 * 4 = 24   7 * 4 = 28   8 * 4 = 32   9 * 4 = 36
   6 * 5 = 30   7 * 5 = 35   8 * 5 = 40   9 * 5 = 45
   6 * 6 = 36   7 * 6 = 42   8 * 6 = 48   9 * 6 = 54
   6 * 7 = 42   7 * 7 = 49   8 * 7 = 56   9 * 7 = 63
   6 * 8 = 48   7 * 8 = 56   8 * 8 = 64   9 * 8 = 72
   6 * 9 = 54   7 * 9 = 63   8 * 9 = 72   9 * 9 = 81

계속하려면 아무 키나 누르십시오 . . .

*/